icebergsocean_case50/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    stationaryWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20480;
        startFace       763344;
    }
    atmosphere
    {
        type            patch;
        nFaces          4096;
        startFace       783824;
    }
    floatingObject
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1350;
        startFace       787920;
    }
)

// ************************************************************************* //
