icebergsocean_case50/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.other 0
    volScalarFieldValue alpha.water 0
);

regions
(

    boxToCell
    {
        box (0 0 0.000000) (1.0 1.0 0.015625);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.991071
            volScalarFieldValue alpha.water 0.008929
        );
    }

    boxToCell
    {
        box (0 0 0.015625) (1.0 1.0 0.031250);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.973214
            volScalarFieldValue alpha.water 0.026786
        );
    }

    boxToCell
    {
        box (0 0 0.031250) (1.0 1.0 0.046875);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.955357
            volScalarFieldValue alpha.water 0.044643
        );
    }

    boxToCell
    {
        box (0 0 0.046875) (1.0 1.0 0.062500);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.937500
            volScalarFieldValue alpha.water 0.062500
        );
    }

    boxToCell
    {
        box (0 0 0.062500) (1.0 1.0 0.078125);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.919643
            volScalarFieldValue alpha.water 0.080357
        );
    }

    boxToCell
    {
        box (0 0 0.078125) (1.0 1.0 0.093750);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.901786
            volScalarFieldValue alpha.water 0.098214
        );
    }

    boxToCell
    {
        box (0 0 0.093750) (1.0 1.0 0.109375);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.883929
            volScalarFieldValue alpha.water 0.116071
        );
    }

    boxToCell
    {
        box (0 0 0.109375) (1.0 1.0 0.125000);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.866071
            volScalarFieldValue alpha.water 0.133929
        );
    }

    boxToCell
    {
        box (0 0 0.125000) (1.0 1.0 0.140625);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.848214
            volScalarFieldValue alpha.water 0.151786
        );
    }

    boxToCell
    {
        box (0 0 0.140625) (1.0 1.0 0.156250);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.830357
            volScalarFieldValue alpha.water 0.169643
        );
    }

    boxToCell
    {
        box (0 0 0.156250) (1.0 1.0 0.171875);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.812500
            volScalarFieldValue alpha.water 0.187500
        );
    }

    boxToCell
    {
        box (0 0 0.171875) (1.0 1.0 0.187500);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.794643
            volScalarFieldValue alpha.water 0.205357
        );
    }

    boxToCell
    {
        box (0 0 0.187500) (1.0 1.0 0.203125);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.776786
            volScalarFieldValue alpha.water 0.223214
        );
    }

    boxToCell
    {
        box (0 0 0.203125) (1.0 1.0 0.218750);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.758929
            volScalarFieldValue alpha.water 0.241071
        );
    }

    boxToCell
    {
        box (0 0 0.218750) (1.0 1.0 0.234375);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.741071
            volScalarFieldValue alpha.water 0.258929
        );
    }

    boxToCell
    {
        box (0 0 0.234375) (1.0 1.0 0.250000);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.723214
            volScalarFieldValue alpha.water 0.276786
        );
    }

    boxToCell
    {
        box (0 0 0.250000) (1.0 1.0 0.265625);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.705357
            volScalarFieldValue alpha.water 0.294643
        );
    }

    boxToCell
    {
        box (0 0 0.265625) (1.0 1.0 0.281250);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.687500
            volScalarFieldValue alpha.water 0.312500
        );
    }

    boxToCell
    {
        box (0 0 0.281250) (1.0 1.0 0.296875);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.669643
            volScalarFieldValue alpha.water 0.330357
        );
    }

    boxToCell
    {
        box (0 0 0.296875) (1.0 1.0 0.312500);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.651786
            volScalarFieldValue alpha.water 0.348214
        );
    }

    boxToCell
    {
        box (0 0 0.312500) (1.0 1.0 0.328125);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.633929
            volScalarFieldValue alpha.water 0.366071
        );
    }

    boxToCell
    {
        box (0 0 0.328125) (1.0 1.0 0.343750);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.616071
            volScalarFieldValue alpha.water 0.383929
        );
    }

    boxToCell
    {
        box (0 0 0.343750) (1.0 1.0 0.359375);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.598214
            volScalarFieldValue alpha.water 0.401786
        );
    }

    boxToCell
    {
        box (0 0 0.359375) (1.0 1.0 0.375000);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.580357
            volScalarFieldValue alpha.water 0.419643
        );
    }

    boxToCell
    {
        box (0 0 0.375000) (1.0 1.0 0.390625);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.562500
            volScalarFieldValue alpha.water 0.437500
        );
    }

    boxToCell
    {
        box (0 0 0.390625) (1.0 1.0 0.406250);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.544643
            volScalarFieldValue alpha.water 0.455357
        );
    }

    boxToCell
    {
        box (0 0 0.406250) (1.0 1.0 0.421875);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.526786
            volScalarFieldValue alpha.water 0.473214
        );
    }

    boxToCell
    {
        box (0 0 0.421875) (1.0 1.0 0.437500);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.508929
            volScalarFieldValue alpha.water 0.491071
        );
    }

    boxToCell
    {
        box (0 0 0.437500) (1.0 1.0 0.453125);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.491071
            volScalarFieldValue alpha.water 0.508929
        );
    }

    boxToCell
    {
        box (0 0 0.453125) (1.0 1.0 0.468750);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.473214
            volScalarFieldValue alpha.water 0.526786
        );
    }

    boxToCell
    {
        box (0 0 0.468750) (1.0 1.0 0.484375);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.455357
            volScalarFieldValue alpha.water 0.544643
        );
    }

    boxToCell
    {
        box (0 0 0.484375) (1.0 1.0 0.500000);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.437500
            volScalarFieldValue alpha.water 0.562500
        );
    }

    boxToCell
    {
        box (0 0 0.500000) (1.0 1.0 0.515625);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.419643
            volScalarFieldValue alpha.water 0.580357
        );
    }

    boxToCell
    {
        box (0 0 0.515625) (1.0 1.0 0.531250);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.401786
            volScalarFieldValue alpha.water 0.598214
        );
    }

    boxToCell
    {
        box (0 0 0.531250) (1.0 1.0 0.546875);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.383929
            volScalarFieldValue alpha.water 0.616071
        );
    }

    boxToCell
    {
        box (0 0 0.546875) (1.0 1.0 0.562500);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.366071
            volScalarFieldValue alpha.water 0.633929
        );
    }

    boxToCell
    {
        box (0 0 0.562500) (1.0 1.0 0.578125);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.348214
            volScalarFieldValue alpha.water 0.651786
        );
    }

    boxToCell
    {
        box (0 0 0.578125) (1.0 1.0 0.593750);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.330357
            volScalarFieldValue alpha.water 0.669643
        );
    }

    boxToCell
    {
        box (0 0 0.593750) (1.0 1.0 0.609375);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.312500
            volScalarFieldValue alpha.water 0.687500
        );
    }

    boxToCell
    {
        box (0 0 0.609375) (1.0 1.0 0.625000);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.294643
            volScalarFieldValue alpha.water 0.705357
        );
    }

    boxToCell
    {
        box (0 0 0.625000) (1.0 1.0 0.640625);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.276786
            volScalarFieldValue alpha.water 0.723214
        );
    }

    boxToCell
    {
        box (0 0 0.640625) (1.0 1.0 0.656250);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.258929
            volScalarFieldValue alpha.water 0.741071
        );
    }

    boxToCell
    {
        box (0 0 0.656250) (1.0 1.0 0.671875);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.241071
            volScalarFieldValue alpha.water 0.758929
        );
    }

    boxToCell
    {
        box (0 0 0.671875) (1.0 1.0 0.687500);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.223214
            volScalarFieldValue alpha.water 0.776786
        );
    }

    boxToCell
    {
        box (0 0 0.687500) (1.0 1.0 0.703125);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.205357
            volScalarFieldValue alpha.water 0.794643
        );
    }

    boxToCell
    {
        box (0 0 0.703125) (1.0 1.0 0.718750);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.187500
            volScalarFieldValue alpha.water 0.812500
        );
    }

    boxToCell
    {
        box (0 0 0.718750) (1.0 1.0 0.734375);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.169643
            volScalarFieldValue alpha.water 0.830357
        );
    }

    boxToCell
    {
        box (0 0 0.734375) (1.0 1.0 0.750000);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.151786
            volScalarFieldValue alpha.water 0.848214
        );
    }

    boxToCell
    {
        box (0 0 0.750000) (1.0 1.0 0.765625);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.133929
            volScalarFieldValue alpha.water 0.866071
        );
    }

    boxToCell
    {
        box (0 0 0.765625) (1.0 1.0 0.781250);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.116071
            volScalarFieldValue alpha.water 0.883929
        );
    }

    boxToCell
    {
        box (0 0 0.781250) (1.0 1.0 0.796875);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.098214
            volScalarFieldValue alpha.water 0.901786
        );
    }

    boxToCell
    {
        box (0 0 0.796875) (1.0 1.0 0.812500);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.080357
            volScalarFieldValue alpha.water 0.919643
        );
    }

    boxToCell
    {
        box (0 0 0.812500) (1.0 1.0 0.828125);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.062500
            volScalarFieldValue alpha.water 0.937500
        );
    }

    boxToCell
    {
        box (0 0 0.828125) (1.0 1.0 0.843750);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.044643
            volScalarFieldValue alpha.water 0.955357
        );
    }

    boxToCell
    {
        box (0 0 0.843750) (1.0 1.0 0.859375);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.026786
            volScalarFieldValue alpha.water 0.973214
        );
    }

    boxToCell
    {
        box (0 0 0.859375) (1.0 1.0 0.875000);
        fieldValues
        (
            volScalarFieldValue alpha.air 0
            volScalarFieldValue alpha.other 0.008929
            volScalarFieldValue alpha.water 0.991071
        );
    }
);


// ************************************************************************* //
